{
    "_name_or_path": "/root/SeaSageAI/XTuner/Shanghai_AI_Laboratory/internlm2_5-20b-chat",
    "architectures": [
      "InternLM2ForCausalLM"
    ],
    "attn_implementation": "eager",
    "auto_map": {
      "AutoConfig": "configuration_internlm2.InternLM2Config",
      "AutoModel": "modeling_internlm2.InternLM2ForCausalLM",
      "AutoModelForCausalLM": "modeling_internlm2.InternLM2ForCausalLM",
      "AutoModelForSequenceClassification": "modeling_internlm2.InternLM2ForSequenceClassification"
    },
    "bias": false,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 6144,
    "initializer_range": 0.02,
    "intermediate_size": 16384,
    "max_position_embeddings": 32768,
    "model_type": "internlm2",
    "num_attention_heads": 48,
    "num_hidden_layers": 48,
    "num_key_value_heads": 8,
    "pad_token_id": 2,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
      "factor": 2.5,
      "type": "dynamic"
    },
    "rope_theta": 50000000,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.39.3",
    "use_cache": true,
    "vocab_size": 92544
  }
  